# Sources
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'teamookla/speedtest'
tap 'arnoldsandoval/homebrew-internal'

# utilities
brew 'git'                        # Distributed revision control system
brew 'tig'                        # Text interface for Git repositories
brew 'antibody'                   # Shell plugin manager
brew 'tmux'                       # Terminal multiplexer
brew 'svn'                        # wtf? see https://github.com/Homebrew/homebrew-cask/issues/80695
brew 'neovim'                     # Ambitious Vim-fork focused on extensibility and agility
brew 'neofetch'                   # Fast, highly customisable system info script
brew 'httpie'                     # User-friendly cURL replacement (command-line HTTP client)
brew 'speedtest'                  # Command-line interface for https://speedtest.net bandwidth tests
brew 'links'                      # Lynx-like WWW browser that supports tables, menus, etc.
brew 'youtube-dl'                 # Download YouTube videos from the command-line
brew 'tree'                       # Display directories as trees (with optional color/HTML output)
brew 'task'                       # Feature-rich console based todo list manager
brew 'flow-cli'                   # Command-line interface that provides utilities for building Flow applications
cask 'proxyman'                   # Modern and intuitive HTTP Debugging Proxy app

# apps
cask '1password'                  # Password manager that keeps all passwords secure behind one password
cask 'airfoil'                    # Sends audio from computer to outputs
cask 'audio-hijack'               # Records from any application
cask 'cleanshot'                  # Screen capturing tool
cask 'discord'                    # Voice and text chat software
cask 'elgato-stream-deck'         # Assign keys, and then decorate and label them
cask 'figma'                      # Design tool
cask 'firefox'                    # Browser: Firefox
cask 'google-chrome'              # Browser: Google Chrome
cask 'hyper'                      # Terminal replacement
cask 'ledger-live'                # Wallet desktop application to maintain multiple cryptocurrencies
cask 'maccy'                      # Clipboard manager
cask 'obs'                        # Open-source software for live streaming and screen recording
cask 'pixelsnap'                  # Screen measuring tool
cask 'qlmarkdown'                 # quicklook for markdown files
cask 'qmk-toolbox'                # Toolbox companion for QMK Firmware
cask 'quicklook-json'             # quicklook for json files
cask 'rectangle'                  # Move and resize windows using keyboard shortcuts or snap areas
cask 'sonos'                      # Jams at home
cask 'soundsource'                # Superior sound control for Mac
cask 'tradingview'                # Charting and social-networking for investment traders
cask 'trezor-suite'               # Companion app for the Trezor hardware wallet
cask 'vanilla'                    # Keeps the menu bar clutter free
cask 'visual-studio-code'         # Favorite IDE
cask 'via'                        # My keyboard's best friend
cask 'kindle'                     # Interface for reading and syncing eBooks

# work
cask 'notion'                     # App to write, plan, collaborate, and get organized
cask 'slack'                      # Team communication and collaboration software

# mac app store apps
mas 'Gif Brewery 3 by Gfycat', id: 1081413713 # Makes GIFs from Video Files

# fonts
cask 'font-fira-mono-nerd-font'
cask 'font-dank-mono'
