# Sources
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'arnoldsandoval/homebrew-internal'

# utilities
brew 'git'                        # Distributed revision control system
brew 'svn'                        # wtf? see https://github.com/Homebrew/homebrew-cask/issues/80695
brew 'nodeenv'
brew 'tree'                       # Display directories as trees (with optional color/HTML output)
brew 'task'                       # Feature-rich console based todo list manager
cask "docker"                     # App to build and share containerized applications and microservices
brew "docker-compose"             # Isolated development environments using Docker
brew "tmux"
brew "starship"                   # Cross-shell prompt for astronauts

# apps
cask '1password'                  # Password manager that keeps all passwords secure behind one password
cask 'cleanshot'                  # Screen capturing tool
cask 'cursor'                     # Write, edit, and chat about your code with AI
cask 'discord'                    # Voice and text chat software
cask 'docker'                    # App to build and share containerized applications and microservices
cask 'elgato-control-center' 
cask 'elgato-stream-deck'
cask 'firefox'                     # Browser: Firefox
cask 'google-chrome'              # Browser: Google Chrome
cask 'pixelsnap'                  # Screen measuring tool
cask 'sonos'                      # Jams at home
cask 'soundsource'                # Superior sound control for Mac
cask 'vanilla'                    # Keeps the menu bar clutter free
cask 'raycast'                    # Control your tools with a few keystrokes
cask 'linear-linear'              # App to manage software development and track bugs
cask 'cyberduck'                  # FTP, SFTP, WebDAV, and cloud storage browser
cask 'iina'                       # Media player for macOS
cask 'claude'                     # AI assistant for writing, coding, and more
cask 'aqua-voice'                # Voice control for Mac 

# work
cask 'notion'                     # App to write, plan, collaborate, and get organized
cask 'slack'                      # Team communication and collaboration software
cask 'postman'                    # Collaboration platform for API development
cask 'figma'                       # Design tool
cask 'visual-studio-code'         # Open-source code editor
cask 'cursor'                     # Write, edit, and chat about your code with AI
cask 'loom'
cask 'ngrok'
cask 'zoom'                       # Video communication and virtual meeting platform
cask 'readdle-spark'
cask 'morgen'

# fonts
cask 'font-fira-mono-nerd-font'
cask 'font-dank-mono'
cask 'font-monolisa'
