# Sources
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'teamookla/speedtest'
tap 'arnoldsandoval/homebrew-internal'

# utilities
brew 'antidote'                   # Plugin manager for zsh, inspired by antigen and antibody
brew 'git'                        # Distributed revision control system
brew 'tig'                        # Text interface for Git repositories
brew 'tmux'                       # Terminal multiplexer
brew 'svn'                        # wtf? see https://github.com/Homebrew/homebrew-cask/issues/80695
brew 'neovim'                     # Ambitious Vim-fork focused on extensibility and agility
brew 'neofetch'                   # Fast, highly customisable system info script
brew 'httpie'                     # User-friendly cURL replacement (command-line HTTP client)
brew 'speedtest'                  # Command-line interface for https://speedtest.net bandwidth tests
brew 'links'                      # Lynx-like WWW browser that supports tables, menus, etc.
brew 'youtube-dl'                 # Download YouTube videos from the command-line
brew 'tree'                       # Display directories as trees (with optional color/HTML output)
brew 'task'                       # Feature-rich console based todo list manager
brew 'flow-cli'                   # Command-line interface that provides utilities for building Flow applications
cask 'proxyman'                   # Modern and intuitive HTTP Debugging Proxy app

# apps
cask '1password'                  # Password manager that keeps all passwords secure behind one password
cask 'audio-hijack'               # Records from any application
cask 'cleanshot'                  # Screen capturing tool
cask 'discord'                    # Voice and text chat software
cask 'elgato-stream-deck'         # Assign keys, and then decorate and label them
cask 'elgato-control-center'      # Control your Elgato Key Lights
cask 'elgato-camera-hub'          # Elgato FACECAM configuration tool
cask 'elgato-wave-link'           # Software custom-built for content creation
cask 'figma'                      # Design tool
cask 'firefox'                    # Browser: Firefox
cask 'google-chrome'              # Browser: Google Chrome
cask 'maccy'                      # Clipboard manager
cask 'obs'                        # Open-source software for live streaming and screen recording
cask 'pixelsnap'                  # Screen measuring tool
cask 'qlmarkdown'                 # quicklook for markdown files
cask 'quicklook-json'             # quicklook for json files
cask 'rectangle'                  # Move and resize windows using keyboard shortcuts or snap areas
cask 'sonos'                      # Jams at home
cask 'soundsource'                # Superior sound control for Mac
cask 'vanilla'                    # Keeps the menu bar clutter free
cask 'visual-studio-code'         # Favorite IDE
cask 'raycast'                    # Control your tools with a few keystrokes
cask 'linear-linear'              # App to manage software development and track bugs
cask 'readdle-spark'              # The email client

# work
cask 'notion'                     # App to write, plan, collaborate, and get organized
cask 'slack'                      # Team communication and collaboration software

# mac app store apps
mas 'Hand Mirror', id: 1502839586   # One-click camera check
mas 'Caffeinated', id: 1362171212   # Keeps your display awake

# fonts
cask 'font-fira-mono-nerd-font'
cask 'font-dank-mono'
cask 'font-monolisa'
