# Brewfile.personal — apps for the personal Mac
brew 'gamdl'
brew 'railway'

cask '1password'
cask 'claude'
cask 'cleanshot'
cask 'discord'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'firefox'
cask 'google-chrome'
cask 'pixelsnap'
cask 'sonos'
cask 'vanilla'
cask 'raycast'
cask 'aqua-voice'
cask 'granola'
cask 'screen-studio'
cask 'figma'
cask 'visual-studio-code'
cask 'docker-desktop'
cask 'postman'
cask 'ngrok'
